import './cssdetails.css';

const CssDetails = () => {
    return (
        <div className="pt-40 container mx-auto">
            <div>
                <div>
                    <div className="css-banner w-full h-[400px] rounded-2xl">

                    </div>
                    <p className='text-6xl my-5 w-7/12'>সিএসএস কি ?? এর ইতিহাস ও বর্তমান অবস্থা। (সিএসএস পর্ব ০১)</p>
                </div>
                <div className='flex justify-between my-14'>
                    <div>
                        <h3 className='font-semibold'>Abdur Rahim</h3>
                        <p className='text-gray-400 font-light'>July-16-2023</p>
                    </div>
                    <div>
                        <a href="">Facebook</a>
                        <a href="">Linkedin</a>
                    </div>
                </div>
                <div className='grid grid-cols-1 gap-4 text-2xl'>
                    <p>এই ব্লগ পড়ে আমরা যা জানতে পারব -</p>
                    <p>১। CSS কেনো প্রয়োজন।</p>
                    <p>২। CSS কারা মেন্টেন করে।</p>
                    <p>৩। বর্তমানে CSS এর অবস্থা।</p>
                </div>
                <div className='my-20'>
                    <p className='text-2xl'>
                        সহজ ভাষায় বলতে হলে একটা ওয়েবসাইট ডিজাইন আনুযায় সাজানোর জন্য CSS ব্যাবহার করা হয়। একটা ফন্টের সাইজ কত হবে, কালার কি হবে, ব্যকগ্রাউন্ড কালার কি হবে, ওয়েবসাইটের কোন এলিমেন্ট কোথায় বসবে এগুলো নির্ধারন করা হয় CSS দিয়ে। CSS এর কাজ হচ্ছে একটা ওয়েবসাইটকে সুন্দর করে তোলা। Front-end ডেভেলপমেন্টের ক্ষেত্রে CSS এর কোর কনসেপ্ট বুঝা অতি প্রয়োজনীয়। কারণ ডিজাইন অনুযায় UI বানানোর জন্য প্রত্যক্ষ বা পরোক্ষভাবে CSS ব্যাবহার করা হয়ে থাকে।
                        <br />
                        <br />
                        <br />
                        CSS আসার আগে HTML পেজে ধরে ধরে স্টাইল ফর্ম্যাটিং করা লাগত। যেটা অনেক সময় সাপেক্ষ ছিলো এবং ডেভেলপমেন্ট এক্সপেরিয়েন্স মোটেও ভালো ছিলোনা। এই সমস্যা সমাধানে ১০ অক্টোবর ১৯৯৪ সালে Håkon Wium Lie, CSS এর প্রস্তাব দেন। এর পর ১৯৯৬ সালের ১৭ ডিসেম্বর CSS এর প্রথম ভার্শন রিলিজ হয়। এর ফলে ডেভেলপাররা যেসব উপকারীতা পায় তা নিচে উল্লেখ যোগ্য -
                        <br />
                        <br />
                        <br />
                        ১। CSS প্রচুর সময় বাচায় - আপনি চিন্তা করে দেখেন, যদি একটা ওয়েবপেজ বানানোর জন্য ধরে ধরে HTML এলিমেন্টে স্টাইল দিতে হতো তাহলে কত সময় লেগে যেতো, তবে CSS এর class বা id ব্যবহার করে খুব সহজে একই স্টাইল একাধিক এলিমেন্টে প্রয়োগ করা যায়।
                        <br />
                        <br />
                        <br />
                        ২। CSS মেন্টেন করা সহজ - আপনি যদি একই স্টাইল একাধিক HTML এলিমেন্টে ব্যবহার করেন তাহলে যদি কখন তা পরিবর্তন করা লাগে তাহলে ধরে ধরে সব গুলো পাল্টাতে হবে। তবে CSS ব্যাবহারের মাধমে আপনি স্টাইলশিটে স্টাইল রূল পরিবর্তন করে দিলে তা সব জায়গায় সেই স্টাইল পরিবর্তন করে দিবে।
                        <br />
                        <br />
                        <br />
                        ৩। রেস্পন্সসিভ লেআউট - বর্তমান সময়ে ডেক্সটপ ডিভাইসের তুলনায় ওয়েবপেজ গুলো মোবাইলে বেশি রেন্ডার হয়। যার কারণে আমাদের খেয়াল রাখতে হয় যেন সব ডিভাইসে লেআউট ঠিক থাকে। এটা CSS দিয়ে খুব সহজে করা সম্ভব।
                        <br />
                        <br />
                        <br />
                        ৪। ওয়েবসাইটের পার্ফমেন্স বৃদ্ধি - CSS ব্যাবহারের মাধ্যমে HTML এর ভিতরে আর আলাদা আলাদা tag আর attribute ব্যবহার করা লাগেনা। যার কারণে পেজের লোডটাইম তুলনামুলক কমে আসে।
                        <br />
                        <br />
                        <br />
                        এখন প্রশ্ন আসতে পারে যে এসব ফিচার CSS এ কে এড করে ?? Håkon Wium Lie ?? নাকি কোন কোম্পানি ? CSS 2.1 পর্যন্ত World Wide Web Consortium (সংক্ষেপে W3C) কর্মরত “CSS Working Group” , CSS এ কি কি থাকবে তার একটা স্পেসিফিকেশন দিতেন। তবে CSS 3 থেকে এমন স্পেসিফিকেশন থেকে সরে এসে এখন মডিউলার আকারে আপডেট গুলো পুশ করা হয়। এই মডিউল গুলো হতে পারে আলাদা কোন ফিচার বা আগের কোন ফিচারের এক্সটেনশন। মডিউল গুলো নিয়ে কাজ করে বড় বড় কিছু কোম্পানি যেমন গুগলে, মোজিলা। এতে করে একাধিক ফিচারের উপর একই সময় কাজ করা সম্ভব হচ্ছে। তবে এর পাশাপাশি ফিচার স্টাবিলিটির একটা সমস্যা সৃষ্টি হয়। দেখা যাচ্ছে একটা ফিচার গুগল ক্রোমে কাজ করছে তে মোজিলা ফায়ারফক্সে কাজ করছেনা বা তার উল্টা।
                        <br />
                        <br />
                        <br />
                        এখন প্রশ্ন হচ্ছে যে, এতো উন্নয়নের যুগে (শুধু বাংলাদেশের না, সারা বিশ্বের কথা বলছি ভাই) আমরা কি আদিম আমলের CSS শিখবো ?? উত্তর হচ্ছে হ্যাঁ আবার না। একটু বুঝিয়ে বলি। শিখতে হবে, তবে এপ্লাই করার সময় আরও ভালো কিছু অপশন আছে। বর্তমান সময়ে CSS এর কাজ গুলো আরো সহজে করার জন্য বেশ কিছু ফ্রেমওয়ার্ক আছে, যেমন Tailwind, Bootstrap. এই জন্য শুরুতে বলেছিলাম পরোক্ষ ভাবেও CSS ব্যবহার হয়। তবে এগুলো ব্যাবহার করার আগে অবশই CSS ভালো ভাবে জানা থাকতে হবে। কারণ এপ্লাই করার সময় CSS এর লজিক গুলো এপ্লাই করা লাগে।
                        <br />
                        <br />
                        <br />
                        আজ এই টুকুই। তবে যাওয়ার আগে একটা কথা, আগে বলতে ভুলে গিয়েছিলাম। এটা একটা পরিচিতি পর্ব। যদি আপনার কিছু বুঝতে কষ্ট হয়ে থাকে তাহলে ভয়ের কিছু নেই। ইনশাল্লাহ সামনের পর্বগুলোতে সব কিছু নিয়েই ভেঙ্গে ভেঙ্গে আলোচনা করা হবে। কিভাবে কাজে লাগাতে হবে, কোনটা দিয়ে কি করে। কোনটা মাথায় দেয়, কোনটা খায়। কিভাবে শুরু করতে হবে। এসব নিয়ে বিস্তর আলোচনা করা হবে।
                    </p>
                </div>
            </div>
        </div>
    );
};

export default CssDetails;